## 📋 Terraform Plan: `tier4_monitoring`

**Plan Status:** `success`
**Workspace:** [`tier4_monitoring`](https://app.terraform.io/app/aws-platform/workspaces/tier4_monitoring)

<details><summary>Show Plan</summary>

```terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/aws-platform/tier4_monitoring/runs/run-KzhxJ43aJYVp3WR8

Waiting for the plan to start...

Terraform v1.12.2
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.compute: Refreshing...
aws_sns_topic.cloudwatch_alerts: Refreshing state... [id=arn:aws:sns:us-east-2:433058264968:thrive-test-cloudwatch-alerts]
aws_sns_topic_subscription.email_alerts: Refreshing state... [id=arn:aws:sns:us-east-2:433058264968:thrive-test-cloudwatch-alerts:5461d003-5847-4267-8ff4-53685a36d7c5]
data.terraform_remote_state.compute: Refresh complete after 0s
data.aws_eks_cluster_auth.cluster: Refreshing...
data.aws_eks_cluster.cluster: Refreshing...
aws_cloudwatch_dashboard.eks_monitoring: Refreshing state... [id=thrive-test-eks-monitoring]
aws_cloudwatch_log_group.fluent_bit: Refreshing state... [id=/aws/containerinsights/thrive-test-eks/application]
aws_cloudwatch_metric_alarm.pod_restart_high: Refreshing state... [id=thrive-test-eks-pod-restart-high]
aws_cloudwatch_metric_alarm.high_memory_utilization: Refreshing state... [id=thrive-test-eks-high-memory-utilization]
data.aws_eks_cluster_auth.cluster: Refresh complete after 0s [id=thrive-test-eks]
aws_cloudwatch_metric_alarm.high_cpu_utilization: Refreshing state... [id=thrive-test-eks-high-cpu-utilization]
data.aws_eks_cluster.cluster: Refresh complete after 1s [id=thrive-test-eks]
aws_iam_role.cloudwatch_agent: Refreshing state... [id=thrive-test-cloudwatch-agent-role]
aws_iam_role_policy_attachment.cloudwatch_container_insights: Refreshing state... [id=thrive-test-cloudwatch-agent-role/arn:aws:iam::aws:policy/CloudWatchLogsFullAccess]
aws_iam_role_policy_attachment.cloudwatch_agent_server_policy: Refreshing state... [id=thrive-test-cloudwatch-agent-role/arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy]
aws_eks_addon.cloudwatch_observability: Refreshing state... [id=thrive-test-eks:amazon-cloudwatch-observability]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_dashboard.eks_monitoring will be updated in-place
  ~ resource "aws_cloudwatch_dashboard" "eks_monitoring" {
      ~ dashboard_body = jsonencode(
          ~ {
              ~ widgets = [
                    # (7 unchanged elements hidden)
                    {
                        height     = 6
                        properties = {
                            metrics = [
                                [
                                    "ContainerInsights",
                                    "node_filesystem_utilization",
                                    "ClusterName",
                                    "thrive-test-eks",
                                ],
                            ]
                            period  = 300
                            region  = "us-east-2"
                            stat    = "Maximum"
                            title   = "Node Filesystem Usage (%)"
                            yAxis   = {
                                left = {
                                    max = 100
                                    min = 0
                                }
                            }
                        }
                        type       = "metric"
                        width      = 8
                        x          = 16
                        y          = 12
                    },
                  ~ {
                      ~ properties = {
                          ~ markdown = "💡 **For detailed analysis:** Go to CloudWatch → Container Insights → Performance Monitoring → EKS Clusters → thrive-test-eks" -> "**For detailed analysis:** Go to CloudWatch → Container Insights"
                        }
                        # (5 unchanged attributes hidden)
                    },
                ]
            }
        )
        id             = "thrive-test-eks-monitoring"
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.webapp_health_check will be created
  + resource "aws_cloudwatch_metric_alarm" "webapp_health_check" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-2:433058264968:thrive-test-cloudwatch-alerts",
        ]
      + alarm_description                     = "This metric monitors webapp health check status"
      + alarm_name                            = "thrive-test-eks-webapp-health-check"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "LoadBalancer" = "net/a4dbbf5d1f7d448ac9fe5abf54b950d1"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "TargetHealth"
      + namespace                             = "AWS/NetworkELB"
      + period                                = 60
      + region                                = "us-east-2"
      + statistic                             = "Average"
      + tags                                  = {
          + "Company"     = "thrive"
          + "Environment" = "test"
          + "ManagedBy"   = "terraform"
          + "Project"     = "aws-platform"
        }
      + tags_all                              = {
          + "Company"     = "thrive"
          + "Environment" = "test"
          + "ManagedBy"   = "terraform"
          + "Project"     = "aws-platform"
        }
      + threshold                             = 1
      + treat_missing_data                    = "breaching"
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ monitoring_info = <<-EOT
        CloudWatch Monitoring Ready
        
        Dashboard:
          https://us-east-2.console.aws.amazon.com/cloudwatch/home?region=us-east-2#dashboards:name=thrive-test-eks-monitoring
            
        Container Insights:
          https://us-east-2.console.aws.amazon.com/cloudwatch/home?region=us-east-2#container-insights:performance/EKS:Cluster?~(query~(controls~(CW*3a*3aEKS.cluster~(~'thrive-test-eks)))~context~(orchestrationService~'eks))
            
        Alerts:
          Email: perch.snarks.2p@icloud.com (update this in tier4_monitoring.tf)
          SNS Topic: thrive-test-cloudwatch-alerts
              
        Metrics Available:
          - CPU utilization (webapp & cluster)
          - Memory utilization (webapp & cluster)  
          - Network traffic (webapp)
          - Request rates (webapp)
          - Pod counts and restarts
            
        Next steps:
        1. Update email address in tier4_monitoring.tf
        2. Confirm email subscription in AWS SNS console
        3. View dashboard for webapp metrics
        4. Check Container Insights for detailed analysis
            
      - Note: Alarms trigger on high CPU (>80%), memory (>80%), or pod restarts (>5)
      + Note: Alarms trigger on high CPU (>80%), memory (>80%), pod restarts (>5), or health check failures
    EOT

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @rafeed-w, Action: `pull_request`, Working Directory: `infra/tier4_monitoring`, Workflow: `Tier4 Monitoring`*